/* automatically generated by rust-bindgen 0.72.1 */

#![allow(unused_variables, non_camel_case_types)]

#[doc = r" If Bindgen could only determine the size and alignment of a"]
#[doc = r" type, it is represented like this."]
#[derive(PartialEq, Copy, Clone, Debug, Hash)]
#[repr(C)]
pub struct __BindgenOpaqueArray<T: Copy, const N: usize>(pub [T; N]);
impl<T: Copy + Default, const N: usize> Default for __BindgenOpaqueArray<T, N> {
    fn default() -> Self {
        Self([<T as Default>::default(); N])
    }
}
pub type Rml_byte = ::std::os::raw::c_uchar;
#[doc = "Templated class for a four-component RGBA colour.\n\n@author Peter Curry"]
pub type Rml_ColourbPremultiplied = __BindgenOpaqueArray<u8, 4usize>;
#[doc = "Templated class for a generic two-component vector.\n@author Peter Curry"]
pub type Rml_Vector2f = Rml_Vector2<f32>;
#[doc = "Templated class for a generic two-component vector.\n@author Peter Curry"]
pub type Rml_Vector2i = Rml_Vector2<::std::os::raw::c_int>;
#[doc = "Templated class for a generic two-component vector.\n@author Peter Curry"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Rml_Vector2<Type> {
    pub _phantom_0: ::std::marker::PhantomData<::std::cell::UnsafeCell<Type>>,
    pub x: Type,
    pub y: Type,
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum Rml_Log_Type {
    LT_ALWAYS = 0,
    LT_ERROR = 1,
    LT_ASSERT = 2,
    LT_WARNING = 3,
    LT_INFO = 4,
    LT_DEBUG = 5,
    LT_MAX = 6,
}
#[repr(u8)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum Rml_Input_KeyIdentifier {
    KI_UNKNOWN = 0,
    KI_SPACE = 1,
    KI_0 = 2,
    KI_1 = 3,
    KI_2 = 4,
    KI_3 = 5,
    KI_4 = 6,
    KI_5 = 7,
    KI_6 = 8,
    KI_7 = 9,
    KI_8 = 10,
    KI_9 = 11,
    KI_A = 12,
    KI_B = 13,
    KI_C = 14,
    KI_D = 15,
    KI_E = 16,
    KI_F = 17,
    KI_G = 18,
    KI_H = 19,
    KI_I = 20,
    KI_J = 21,
    KI_K = 22,
    KI_L = 23,
    KI_M = 24,
    KI_N = 25,
    KI_O = 26,
    KI_P = 27,
    KI_Q = 28,
    KI_R = 29,
    KI_S = 30,
    KI_T = 31,
    KI_U = 32,
    KI_V = 33,
    KI_W = 34,
    KI_X = 35,
    KI_Y = 36,
    KI_Z = 37,
    KI_OEM_1 = 38,
    KI_OEM_PLUS = 39,
    KI_OEM_COMMA = 40,
    KI_OEM_MINUS = 41,
    KI_OEM_PERIOD = 42,
    KI_OEM_2 = 43,
    KI_OEM_3 = 44,
    KI_OEM_4 = 45,
    KI_OEM_5 = 46,
    KI_OEM_6 = 47,
    KI_OEM_7 = 48,
    KI_OEM_8 = 49,
    KI_OEM_102 = 50,
    KI_NUMPAD0 = 51,
    KI_NUMPAD1 = 52,
    KI_NUMPAD2 = 53,
    KI_NUMPAD3 = 54,
    KI_NUMPAD4 = 55,
    KI_NUMPAD5 = 56,
    KI_NUMPAD6 = 57,
    KI_NUMPAD7 = 58,
    KI_NUMPAD8 = 59,
    KI_NUMPAD9 = 60,
    KI_NUMPADENTER = 61,
    KI_MULTIPLY = 62,
    KI_ADD = 63,
    KI_SEPARATOR = 64,
    KI_SUBTRACT = 65,
    KI_DECIMAL = 66,
    KI_DIVIDE = 67,
    KI_OEM_NEC_EQUAL = 68,
    KI_BACK = 69,
    KI_TAB = 70,
    KI_CLEAR = 71,
    KI_RETURN = 72,
    KI_PAUSE = 73,
    KI_CAPITAL = 74,
    KI_KANA = 75,
    KI_HANGUL = 76,
    KI_JUNJA = 77,
    KI_FINAL = 78,
    KI_HANJA = 79,
    KI_KANJI = 80,
    KI_ESCAPE = 81,
    KI_CONVERT = 82,
    KI_NONCONVERT = 83,
    KI_ACCEPT = 84,
    KI_MODECHANGE = 85,
    KI_PRIOR = 86,
    KI_NEXT = 87,
    KI_END = 88,
    KI_HOME = 89,
    KI_LEFT = 90,
    KI_UP = 91,
    KI_RIGHT = 92,
    KI_DOWN = 93,
    KI_SELECT = 94,
    KI_PRINT = 95,
    KI_EXECUTE = 96,
    KI_SNAPSHOT = 97,
    KI_INSERT = 98,
    KI_DELETE = 99,
    KI_HELP = 100,
    KI_LWIN = 101,
    KI_RWIN = 102,
    KI_APPS = 103,
    KI_POWER = 104,
    KI_SLEEP = 105,
    KI_WAKE = 106,
    KI_F1 = 107,
    KI_F2 = 108,
    KI_F3 = 109,
    KI_F4 = 110,
    KI_F5 = 111,
    KI_F6 = 112,
    KI_F7 = 113,
    KI_F8 = 114,
    KI_F9 = 115,
    KI_F10 = 116,
    KI_F11 = 117,
    KI_F12 = 118,
    KI_F13 = 119,
    KI_F14 = 120,
    KI_F15 = 121,
    KI_F16 = 122,
    KI_F17 = 123,
    KI_F18 = 124,
    KI_F19 = 125,
    KI_F20 = 126,
    KI_F21 = 127,
    KI_F22 = 128,
    KI_F23 = 129,
    KI_F24 = 130,
    KI_NUMLOCK = 131,
    KI_SCROLL = 132,
    KI_OEM_FJ_JISHO = 133,
    KI_OEM_FJ_MASSHOU = 134,
    KI_OEM_FJ_TOUROKU = 135,
    KI_OEM_FJ_LOYA = 136,
    KI_OEM_FJ_ROYA = 137,
    KI_LSHIFT = 138,
    KI_RSHIFT = 139,
    KI_LCONTROL = 140,
    KI_RCONTROL = 141,
    KI_LMENU = 142,
    KI_RMENU = 143,
    KI_BROWSER_BACK = 144,
    KI_BROWSER_FORWARD = 145,
    KI_BROWSER_REFRESH = 146,
    KI_BROWSER_STOP = 147,
    KI_BROWSER_SEARCH = 148,
    KI_BROWSER_FAVORITES = 149,
    KI_BROWSER_HOME = 150,
    KI_VOLUME_MUTE = 151,
    KI_VOLUME_DOWN = 152,
    KI_VOLUME_UP = 153,
    KI_MEDIA_NEXT_TRACK = 154,
    KI_MEDIA_PREV_TRACK = 155,
    KI_MEDIA_STOP = 156,
    KI_MEDIA_PLAY_PAUSE = 157,
    KI_LAUNCH_MAIL = 158,
    KI_LAUNCH_MEDIA_SELECT = 159,
    KI_LAUNCH_APP1 = 160,
    KI_LAUNCH_APP2 = 161,
    KI_OEM_AX = 162,
    KI_ICO_HELP = 163,
    KI_ICO_00 = 164,
    KI_PROCESSKEY = 165,
    KI_ICO_CLEAR = 166,
    KI_ATTN = 167,
    KI_CRSEL = 168,
    KI_EXSEL = 169,
    KI_EREOF = 170,
    KI_PLAY = 171,
    KI_ZOOM = 172,
    KI_PA1 = 173,
    KI_OEM_CLEAR = 174,
    KI_LMETA = 175,
    KI_RMETA = 176,
    KI_FIRST_CUSTOM_KEY = 177,
    KI_LAST_CUSTOM_KEY = 250,
}
#[doc = "The element that makes up all geometry sent to the renderer.\n\n@author Peter Curry"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct Rml_Vertex {
    #[doc = " Two-dimensional position of the vertex (usually in pixels)."]
    pub position: Rml_Vector2f,
    #[doc = " RGBA-ordered 8-bit/channel colour with premultiplied alpha."]
    pub colour: Rml_ColourbPremultiplied,
    #[doc = " Texture coordinate for any associated texture."]
    pub tex_coord: Rml_Vector2f,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of Rml_Vertex"][::std::mem::size_of::<Rml_Vertex>() - 20usize];
    ["Alignment of Rml_Vertex"][::std::mem::align_of::<Rml_Vertex>() - 4usize];
    ["Offset of field: Rml_Vertex::position"]
        [::std::mem::offset_of!(Rml_Vertex, position) - 0usize];
    ["Offset of field: Rml_Vertex::colour"][::std::mem::offset_of!(Rml_Vertex, colour) - 8usize];
    ["Offset of field: Rml_Vertex::tex_coord"]
        [::std::mem::offset_of!(Rml_Vertex, tex_coord) - 12usize];
};
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum Rml_ClipMaskOperation {
    Set = 0,
    SetInverse = 1,
    Intersect = 2,
}
#[repr(i32)]
#[non_exhaustive]
#[derive(Debug, Copy, Clone, Hash, PartialEq, Eq)]
pub enum Rml_BlendMode {
    Blend = 0,
    Replace = 1,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: Rml_Vector2_open0_float_close0"]
        [::std::mem::size_of::<Rml_Vector2<f32>>() - 8usize];
    ["Align of template specialization: Rml_Vector2_open0_float_close0"]
        [::std::mem::align_of::<Rml_Vector2<f32>>() - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of template specialization: Rml_Vector2_open0_int_close0"]
        [::std::mem::size_of::<Rml_Vector2<::std::os::raw::c_int>>() - 8usize];
    ["Align of template specialization: Rml_Vector2_open0_int_close0"]
        [::std::mem::align_of::<Rml_Vector2<::std::os::raw::c_int>>() - 4usize];
};
